app/controllers/pages_controller.rb

  def find_by_category
    category = Category.find_by_name(params[:id].capitalize)
    @results = Page.where(category_id: category.id)
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`name` = 'Blog' LIMIT 1
SELECT `pages`.* FROM `pages` WHERE `pages`.`category_id` = 1