app/controllers/posts_controller.rb

  def find_by_category
    category = Category.find_by_name(params[:id].capitalize)
    @results = Post.where(category_id: category.id).order("created_at ASC")
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`name` = 'Blog' LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`category_id` = 1 ORDER BY created_at DESC