app/controllers/tags_controller.rb

SELECT `tags`.* FROM `tags`
---
  def index
    @results = Tag.all()